; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-35)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 35
2. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 26 of 35
3. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 26 of 35
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 26 of 35
5. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 26 of 35
6. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 27 of 35
7. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 27 of 35
8. (pick ball29 room5 left)
   deleted: (at ball29 room5) (free left)
   added: (carry ball29 left)
   goals met: 27 of 35
9. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 27 of 35
10. (drop ball29 room4 left)
   deleted: (carry ball29 left)
   added: (at ball29 room4) (free left)
   goals met: 28 of 35
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 35
12. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 29 of 35
13. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 29 of 35
14. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 29 of 35
15. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 30 of 35
16. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 30 of 35
17. (pick ball28 room5 left)
   deleted: (at ball28 room5) (free left)
   added: (carry ball28 left)
   goals met: 30 of 35
18. (pick ball27 room5 right)
   deleted: (at ball27 room5) (free right)
   added: (carry ball27 right)
   goals met: 30 of 35
19. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 30 of 35
20. (drop ball27 room4 right)
   deleted: (carry ball27 right)
   added: (at ball27 room4) (free right)
   goals met: 31 of 35
21. (drop ball28 room4 left)
   deleted: (carry ball28 left)
   added: (at ball28 room4) (free left)
   goals met: 32 of 35
22. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 32 of 35
23. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 32 of 35
24. (pick ball25 room5 right)
   deleted: (at ball25 room5) (free right)
   added: (carry ball25 right)
   goals met: 32 of 35
25. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 32 of 35
26. (drop ball25 room4 right)
   deleted: (carry ball25 right)
   added: (at ball25 room4) (free right)
   goals met: 33 of 35
27. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 34 of 35
28. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 34 of 35
29. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 34 of 35
30. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 34 of 35
31. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 35 of 35
